answers = [
    # Положительные
    'Бесспорно',
    'Предрешено',
    'Никаких сомнений',
    'Определённо да',
    'Можешь быть уверен в этом',

    # Нерешительно положительные
    'Мне кажется — «да»',
    'Вероятнее всего',
    'Хорошие перспективы',
    'Знаки говорят — «да»',
    'Да',

    # Нейтральные
    'Пока не ясно, попробуй снова',
    'Спроси позже',
    'Лучше не рассказывать',
    'Сейчас нельзя предсказать',
    'Сконцентрируйся и спроси опять',

    # Отрицательные
    'Даже не думай',
    'Мой ответ — «нет»',
    'По моим данным — «нет»',
    'Перспективы не очень хорошие',
    'Весьма сомнительно'
    ]
    greeting = [
        "Привіт друже. Відповідаю на твоє запитання ",
        " Хто запитує той получає відповідь",
        "Привіт смертний. Сьогодні для тебе така відповідь"
    ]
    p greeting.sample
    print "Знаки говорять - ", answers.sample  # методо sample  вибирає рандомне значення з блоку  answer

