# Новий твір про Бутово
 puts "Ішовши місто прогулювався і зустрічаєш дівчину яка кудась іде і в тебе в вічуттях появилося бажання щось зробити. \
 Які варіанти вибереш? "
 
 puts " 1.Соромязливо і поспішаючи питаєш Добрий день, не підскажете яка година?"
 puts "2. Сміливо: Привіт ми раніше не могли зустрі"
 puts "3. Пройдеш мимо"

 choice = gets.chomp
 until choice == '1' || choice =='2' || choice =='3' do
  puts 'не вірно введений символ, введіть ще раз'
  choice = gets.chomp
 end

 if choice == "1"
        puts " - добрий день. 12.30  "
        puts "Вона  іде далі і ти зрозумів що наздожену її. але треба швидко щось запитати"
        sleep 4
        puts "1. Що робите вечері?"
        puts "2. Ви мені сподобались познайомимось?"
        puts "3. ей мала ти кул)"
    
        choice = gets.chomp
        if choice == "1"
            puts " Я не знайомлюся на вулиці удачі. "
            puts " Ти програв "
            sleep 4
            exit
        end
        choice = gets.chomp
        if choice == "2"
            puts " мм ти мені теж давай "
            puts "Ти виграв молодец"
            sleep 6
            exit
        end
        choice = gets.chomp
        if choice == "3"
            puts " іди малий збоченець"
            puts " Ти програв "
                sleep 4
                exit
        end
    end
if choice == "2"
        puts "привіт ні я тебе не знаю "
        puts " Ти програв "
        sleep 4
            exit
    end 
if choice == '3'
            puts "ти ідеш далі і падає тобі на голову шишка з дерева і ти розумієш краще я був з нею познайомився "
            puts "Ти програв"
            sleep 4
            exit  
end

   
 
